{
  "candidate": "Shubham Jagdhane",
  "batch": "2018",
  "course": "MCA",
  "company": "QiO",
  "hiring": "ON Campus Virtual Drive",
  "period": "Feb-2021",
  "company_logo": "https://qio.ai/wp-content/uploads/logo-Qio-theme.png",
  "rounds": [
    {
      "name": "First Round",
      "type": "Apptitude - 30mins",
      "description": [
        "Company sent a link of website called test.gclocked.com, the platform was like google form. There were total 50 questions with no negative mark. They divided MCQ into six sections as number series and find the missing number or pattern, basic web development, Java classes, testing, basic networking questions and I don't remember the last one sorry for that."
      ],
      "difficulty": "Medium",
      "focused": "Problem solving, basic concept of web development, Java classes, testing and basic networking.",
      "result": "Out of 60-70 students 17 get qualified for the next round"
    },
    {
      "name": "Second Round",
      "type": "Technical Interview",
      "description": [
        "This round was held on Team, there were two peoples. They asked me to introduce yourself then they were asking about my intership and the academics projects.",
        "As I had mentioned Python3.X in my resume they asked me to write code for Count Characters from a string in Python3.X it is basic question they allow me share screen and I wrote code for the same, later they asked me to consider input string as case insensitive(treat lowercase and uppercase alphabets as same) I just made one line change.",
        "Docker was mentioned in my resume so they asked me about command to build docker image.",
        "Later they asked about for what purpose I used 'make' in my project.",
        "Difference between SQL and NoSQL, why did I use MongoDB in my project.",
        "As I also mentioned socket programming they asked me about what is socket and give me example where is socket as end user perspective I told them about the Netflix and how it work.",
        "Join in SQL I told them types of join. Later they gave me two tables as employee(emp_id, ename) and dept(dname, emp_id) and asked me two queries.",
        "1) write query to display employee name along with it's department name.",
        "2) Display how many employees in each department, I wrote both queries."
      ],
      "difficulty": "Easy",
      "focused": "Mentioned projects in the resume, SQL queries",
      "result": "This round is lasts for 40mins and from 17 students 7 of us get qualified to the third round"
    },
    {
      "name": "Third Round",
      "type": "Leadership Round - 15mins",
      "description": [
        "This round was held on Team, there were two peoples HR and CTO they started asking about",
        "How was your day..",
        "What you did in lockdown period..",
        "CTO was asking about intership projects..",
        "Where you wanna see yourself in next 5yrs then next 10yrs..",
        "Give your approach on building big, complex, highly scalable project.."
      ],
      "difficulty": "Medium",
      "focused": "How you can handle situations, your way of thinking",
      "result": "From 7 students 4 got final offer, I wasn't one of them"
    }
  ]
}